###################################################################

# Created by write_sdc on Thu Jan 12 01:59:24 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports busy]
set_load -pin_load 1 [get_ports finish]
set_max_fanout 6 [get_ports clk]
set_max_fanout 6 [get_ports reset]
set_max_fanout 6 [get_ports in_en]
set_max_fanout 6 [get_ports {din[7]}]
set_max_fanout 6 [get_ports {din[6]}]
set_max_fanout 6 [get_ports {din[5]}]
set_max_fanout 6 [get_ports {din[4]}]
set_max_fanout 6 [get_ports {din[3]}]
set_max_fanout 6 [get_ports {din[2]}]
set_max_fanout 6 [get_ports {din[1]}]
set_max_fanout 6 [get_ports {din[0]}]
set_max_fanout 6 [get_ports {sao_type[1]}]
set_max_fanout 6 [get_ports {sao_type[0]}]
set_max_fanout 6 [get_ports {sao_band_pos[4]}]
set_max_fanout 6 [get_ports {sao_band_pos[3]}]
set_max_fanout 6 [get_ports {sao_band_pos[2]}]
set_max_fanout 6 [get_ports {sao_band_pos[1]}]
set_max_fanout 6 [get_ports {sao_band_pos[0]}]
set_max_fanout 6 [get_ports sao_eo_class]
set_max_fanout 6 [get_ports {sao_offset[15]}]
set_max_fanout 6 [get_ports {sao_offset[14]}]
set_max_fanout 6 [get_ports {sao_offset[13]}]
set_max_fanout 6 [get_ports {sao_offset[12]}]
set_max_fanout 6 [get_ports {sao_offset[11]}]
set_max_fanout 6 [get_ports {sao_offset[10]}]
set_max_fanout 6 [get_ports {sao_offset[9]}]
set_max_fanout 6 [get_ports {sao_offset[8]}]
set_max_fanout 6 [get_ports {sao_offset[7]}]
set_max_fanout 6 [get_ports {sao_offset[6]}]
set_max_fanout 6 [get_ports {sao_offset[5]}]
set_max_fanout 6 [get_ports {sao_offset[4]}]
set_max_fanout 6 [get_ports {sao_offset[3]}]
set_max_fanout 6 [get_ports {sao_offset[2]}]
set_max_fanout 6 [get_ports {sao_offset[1]}]
set_max_fanout 6 [get_ports {sao_offset[0]}]
set_max_fanout 6 [get_ports {lcu_x[2]}]
set_max_fanout 6 [get_ports {lcu_x[1]}]
set_max_fanout 6 [get_ports {lcu_x[0]}]
set_max_fanout 6 [get_ports {lcu_y[2]}]
set_max_fanout 6 [get_ports {lcu_y[1]}]
set_max_fanout 6 [get_ports {lcu_y[0]}]
set_max_fanout 6 [get_ports {lcu_size[1]}]
set_max_fanout 6 [get_ports {lcu_size[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 6  -waveform {0 3}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports reset]
set_input_delay -clock clk  1  [get_ports in_en]
set_input_delay -clock clk  1  [get_ports {din[7]}]
set_input_delay -clock clk  1  [get_ports {din[6]}]
set_input_delay -clock clk  1  [get_ports {din[5]}]
set_input_delay -clock clk  1  [get_ports {din[4]}]
set_input_delay -clock clk  1  [get_ports {din[3]}]
set_input_delay -clock clk  1  [get_ports {din[2]}]
set_input_delay -clock clk  1  [get_ports {din[1]}]
set_input_delay -clock clk  1  [get_ports {din[0]}]
set_input_delay -clock clk  1  [get_ports {sao_type[1]}]
set_input_delay -clock clk  1  [get_ports {sao_type[0]}]
set_input_delay -clock clk  1  [get_ports {sao_band_pos[4]}]
set_input_delay -clock clk  1  [get_ports {sao_band_pos[3]}]
set_input_delay -clock clk  1  [get_ports {sao_band_pos[2]}]
set_input_delay -clock clk  1  [get_ports {sao_band_pos[1]}]
set_input_delay -clock clk  1  [get_ports {sao_band_pos[0]}]
set_input_delay -clock clk  1  [get_ports sao_eo_class]
set_input_delay -clock clk  1  [get_ports {sao_offset[15]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[14]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[13]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[12]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[11]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[10]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[9]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[8]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[7]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[6]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[5]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[4]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[3]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[2]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[1]}]
set_input_delay -clock clk  1  [get_ports {sao_offset[0]}]
set_input_delay -clock clk  1  [get_ports {lcu_x[2]}]
set_input_delay -clock clk  1  [get_ports {lcu_x[1]}]
set_input_delay -clock clk  1  [get_ports {lcu_x[0]}]
set_input_delay -clock clk  1  [get_ports {lcu_y[2]}]
set_input_delay -clock clk  1  [get_ports {lcu_y[1]}]
set_input_delay -clock clk  1  [get_ports {lcu_y[0]}]
set_input_delay -clock clk  1  [get_ports {lcu_size[1]}]
set_input_delay -clock clk  1  [get_ports {lcu_size[0]}]
set_output_delay -clock clk  1  [get_ports busy]
set_output_delay -clock clk  1  [get_ports finish]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports in_en]
set_drive 1  [get_ports {din[7]}]
set_drive 1  [get_ports {din[6]}]
set_drive 1  [get_ports {din[5]}]
set_drive 1  [get_ports {din[4]}]
set_drive 1  [get_ports {din[3]}]
set_drive 1  [get_ports {din[2]}]
set_drive 1  [get_ports {din[1]}]
set_drive 1  [get_ports {din[0]}]
set_drive 1  [get_ports {sao_type[1]}]
set_drive 1  [get_ports {sao_type[0]}]
set_drive 1  [get_ports {sao_band_pos[4]}]
set_drive 1  [get_ports {sao_band_pos[3]}]
set_drive 1  [get_ports {sao_band_pos[2]}]
set_drive 1  [get_ports {sao_band_pos[1]}]
set_drive 1  [get_ports {sao_band_pos[0]}]
set_drive 1  [get_ports sao_eo_class]
set_drive 1  [get_ports {sao_offset[15]}]
set_drive 1  [get_ports {sao_offset[14]}]
set_drive 1  [get_ports {sao_offset[13]}]
set_drive 1  [get_ports {sao_offset[12]}]
set_drive 1  [get_ports {sao_offset[11]}]
set_drive 1  [get_ports {sao_offset[10]}]
set_drive 1  [get_ports {sao_offset[9]}]
set_drive 1  [get_ports {sao_offset[8]}]
set_drive 1  [get_ports {sao_offset[7]}]
set_drive 1  [get_ports {sao_offset[6]}]
set_drive 1  [get_ports {sao_offset[5]}]
set_drive 1  [get_ports {sao_offset[4]}]
set_drive 1  [get_ports {sao_offset[3]}]
set_drive 1  [get_ports {sao_offset[2]}]
set_drive 1  [get_ports {sao_offset[1]}]
set_drive 1  [get_ports {sao_offset[0]}]
set_drive 1  [get_ports {lcu_x[2]}]
set_drive 1  [get_ports {lcu_x[1]}]
set_drive 1  [get_ports {lcu_x[0]}]
set_drive 1  [get_ports {lcu_y[2]}]
set_drive 1  [get_ports {lcu_y[1]}]
set_drive 1  [get_ports {lcu_y[0]}]
set_drive 1  [get_ports {lcu_size[1]}]
set_drive 1  [get_ports {lcu_size[0]}]
